import pandas as pd
import pytest


@pytest.fixture
def test_api_currency():
    return {"success": True, "timestamp": 1779823266, "base": "RUB", "date": "2026-05-26", "rates": {"EUR": 0.011943}}


@pytest.fixture
def test_api_currency_1():
    return [{"currency": "EUR", "rate": 83.73}]


@pytest.fixture
def test_stock():
    return [{"stock": "AAPL", "price": 308.65}]


@pytest.fixture
def test_file():
    return {
        "Дата операции": {4761: "21.03.2019 17:01:38", 5423: "23.10.2018 12:26:15", 10: "30.12.2021 17:50:17"},
        "Дата платежа": {4761: "21.03.2019", 5423: "23.10.2018", 10: "30.12.2021"},
        "Номер карты": {4761: 0, 5423: 0, 10: "*4556"},
        "Статус": {4761: "OK", 5423: "OK", 10: "OK"},
        "Сумма операции": {4761: 190044.51, 5423: 177506.03, 10: 174000.0},
        "Валюта операции": {4761: "RUB", 5423: "RUB", 10: "RUB"},
        "Сумма платежа": {4761: 190044.51, 5423: 177506.03, 10: 174000.0},
        "Валюта платежа": {4761: "RUB", 5423: "RUB", 10: "RUB"},
        "Кэшбэк": {4761: 0.0, 5423: 0.0, 10: 0.0},
        "Категория": {4761: "Переводы", 5423: "Переводы", 10: "Пополнения"},
        "MCC": {4761: 0.0, 5423: 0.0, 10: 0.0},
        "Описание": {
            4761: "Перевод Кредитная карта. ТП 10.2 RUR",
            5423: "Перевод Кредитная карта. ТП 10.2 RUR",
            10: "Пополнение через Газпромбанк",
        },
        "Бонусы (включая кэшбэк)": {4761: 0, 5423: 0, 10: 0},
        "Округление на инвесткопилку": {4761: 0, 5423: 0, 10: 0},
        "Сумма операции с округлением": {4761: 190044.51, 5423: 177506.03, 10: 174000.0},
    }


@pytest.fixture
def df_test_1():
    data = [
        ["24.04.2020", -1963, "RUB", "Супермаркеты", "ВкусВилл"],
        ["19.03.2020", -2359, "RUB", "Супермаркеты", "Самокат"],
        ["06.04.2020", -955, "RUB", "Супермаркеты", "Пятерочка"],
        ["14.05.2020", -347, "RUB", "Транспорт", "Такси"],
        ["21.03.2020", -100, "RUB", "Транспорт", "Метро"],
        ["07.02.2020", -3500, "RUB", "Перевод", "Иванов И.И."],
        ["24.05.2020", -708, "RUB", "Переводы", "Петров П.П."],
        ["13.03.2020", -5500, "RUB", "Наличные", "Снятие с банкомата"],
        ["06.05.2020", -500, "RUB", "Наличные", "Снятие с банкомата"],
        ["11.04.2020", 89, "RUB", "Бонусы", "КЭШбэк"],
        ["21.02.2020", 800, "RUB", "Бонусы", "КЭШбэк"],
    ]
    df = pd.DataFrame(data, columns=["Дата платежа", "Сумма операции", "Валюта операции", "Категория", "Описание"])
    return df


@pytest.fixture
def result_category():
    return {
        "Наличные": 6000,
        "Основные": {"Наличные": 6000, "Перевод": 3500, "Переводы": 708, "Супермаркеты": 5277, "Транспорт": 447},
        "Остальное": 0,
        "Переводы": 708,
    }


@pytest.fixture
def search_1():
    return (
        '[{"Дата операции": "20.12.2021 19:35:26", "Дата платежа": "20.12.2021", '
        '"Номер карты": "*5091", "Статус": "OK", "Сумма операции": 495.0, "Валюта '
        'операции": "RUB", "Сумма платежа": 495.0, "Валюта платежа": "RUB", "Кэшбэк": '
        '"", "Категория": "Бонусы", "MCC": "", "Описание": "Выплата по вашему '
        'обращению", "Бонусы (включая кэшбэк)": 0, "Округление на инвесткопилку": 0, '
        '"Сумма операции с округлением": 495.0}, {"Дата операции": "20.12.2021 '
        '19:40:28", "Дата платежа": "20.12.2021", "Номер карты": "*5091", "Статус": '
        '"OK", "Сумма операции": 232.96, "Валюта операции": "RUB", "Сумма платежа": '
        '232.96, "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Бонусы", "MCC": '
        '"", "Описание": "Выплата по вашему обращению", "Бонусы (включая кэшбэк)": 0, '
        '"Округление на инвесткопилку": 0, "Сумма операции с округлением": 232.96}]'
    )


@pytest.fixture
def expenses():
    return (
        '{"Дата платежа":{"1":"2020-03-19T00:00:00.000"},"Сумма '
        'операции":{"1":-2359},"Валюта '
        'операции":{"1":"RUB"},"Категория":{"1":"Супермаркеты"},"Описание":{"1":"Самокат"}}'
    )


@pytest.fixture
def expenses_1():
    return '{"Дата платежа":{},"Сумма операции":{},"Валюта ' 'операции":{},"Категория":{},"Описание":{}}'


@pytest.fixture
def operation_1():
    return {
        "currency_rates": [{"amount": 3500.0, "category": "Пополнения"}, {"amount": 1902.15, "category": "Каршеринг"}],
        "expenses": {
            "main": [
                {"amount": 14216.42, "category": "ЖКХ"},
                {"amount": 6749.75, "category": "Каршеринг"},
                {"amount": 5986.0, "category": "Переводы"},
                {"amount": 4345.95, "category": "Супермаркеты"},
                {"amount": 3499.0, "category": "Электроника и техника"},
                {"amount": 3226.54, "category": "Фастфуд"},
                {"amount": 2177.0, "category": "Дом и ремонт"},
            ],
            "total_amount": 47214,
            "transfer_and_cash": [{"amount": 0, "category": "Наличные"}, {"amount": 5986, "category": "Переводы"}],
        },
        "income": {
            "main": [
                {"amount": 3500.0, "category": "Пополнения"},
                {"amount": 1902.15, "category": "Каршеринг"},
                {"amount": 1311.78, "category": "Бонусы"},
                {"amount": 421.0, "category": "Различные товары"},
            ],
            "total_amount": 7134,
        },
        "stock_prices": [{"price": 310.52, "stock": "AAPL"}, {"price": 271.29, "stock": "AMZN"}],
    }


@pytest.fixture
def operation_2():
    return [{"amount": 3500.0, "category": "Пополнения"}, {"amount": 1902.15, "category": "Каршеринг"}]


@pytest.fixture
def operation_3():
    return [
        {"price": 310.52, "stock": "AAPL"},
        {"price": 271.29, "stock": "AMZN"},
    ]


@pytest.fixture
def operation_4():
    return {
        "currency_rates": [{"amount": 3500.0, "category": "Пополнения"}, {"amount": 1902.15, "category": "Каршеринг"}],
        "expenses": {
            "main": [
                {"amount": 14216.42, "category": "ЖКХ"},
                {"amount": 5886.0, "category": "Переводы"},
                {"amount": 2158.95, "category": "Супермаркеты"},
                {"amount": 1909.54, "category": "Фастфуд"},
                {"amount": 1160.0, "category": "Местный транспорт"},
                {"amount": 1150.0, "category": "Дом и ремонт"},
                {"amount": 821.0, "category": "Различные товары"},
            ],
            "total_amount": 30086,
            "transfer_and_cash": [{"amount": 0, "category": "Наличные"}, {"amount": 5886, "category": "Переводы"}],
        },
        "income": {
            "main": [
                {"amount": 1721.38, "category": "Каршеринг"},
                {"amount": 1311.78, "category": "Бонусы"},
                {"amount": 421.0, "category": "Различные товары"},
            ],
            "total_amount": 3454,
        },
        "stock_prices": [{"price": 310.52, "stock": "AAPL"}, {"price": 271.29, "stock": "AMZN"}],
    }
